<style scoped>
</style>
<template>
  <div class="layout">
    <Layout>
      <Header class="spider-header">
        <div>
          <div class="spider-logo">Spider Robot</div>
          <div class="spider-login">
            <Button type="info" @click="showLogin()">登录</Button>
          </div>
        </div>
      </Header>
      <Layout class="spider-border">
        <Sider hide-trigger class="spider-sider">
          <FTab></FTab>
        </Sider>
        <Layout>
          <Content class="spider-code-com">
            <div class="spider-code-tool">
              <Select
                v-model="modelLanguage"
                class="spider-select-language"
                @on-change="changeLanguage"
              >
                <Option
                  class="spider-select-option"
                  v-for="item in languageList"
                  :value="item.value"
                  :key="item.value"
                >{{ item.label }}</Option>
              </Select>
              <Select class="spider-select-url" v-model="modelUrl" filterable>
                <Option
                  v-for="item in urlList"
                  :value="item.value"
                  :key="item.value"
                >{{ item.label }}</Option>
              </Select>
              <Button type="primary" size="small">配置URL</Button>
            </div>
            <div class="spider-code-core">
              <div class="spider-split" :style="domHeight" style="overflow:hidden;">
                <Split v-model="split2" mode="vertical" @on-move-end="changeConsoleSize">
                  <div slot="top">
                    <MonacoEditor
                      :width="editorWidth"
                      :height="editorHeight"
                      theme="vs-dark"
                      :language="currentLanguage"
                      :options="options"
                      @change="onChange"
                    ></MonacoEditor>
                  </div>
                  <div slot="bottom">
                    <Tabs>
                      <TabPane label="JSON">
                        <Scroll :height="scrollHeight" class="spider-console-content">
                          周二早上好，有没有听周杰伦的最新单曲？
                          周杰伦回归歌坛
                          @新京报【周杰伦回归歌坛，《说好不哭》销量突破两百万】9月16日晚上11:00，周杰伦最新单曲《说好不哭》上线。在新歌上线25分钟时，这首单曲在QQ音乐、酷我音乐、酷狗音乐三个音乐平台上总销售量约229万，销售额突破680万元。
                          如今，距离周杰伦上次推出专辑《周杰伦的床边故事》已经过去了三年多的时间，离上次推出新歌《不爱我就拉倒》也已过去了一年有余。此次新歌依然由周杰伦搭档词人方文山合作完成，主题围绕“成全”和“约定”，在歌曲的后半段中，还出现了五月天主唱阿信的合唱声音。
                          美油创11年以来最大单日涨幅
                          @每日经济新闻【美油创逾11年最大单日涨幅】纽约油价16日上涨，10月交货的纽约轻质原油期货价格收涨8.05美元，涨幅14.68%，报62.90美元/桶，创2008年12月份以来最大单日涨幅。布伦特11月原油期货收涨8.80美元，涨幅14.61%，至少创1988年以来最大单日涨幅，报69.02美元/桶。
                          有市场消息称，沙特阿美Abqaiq工厂未来数周都将无法恢复大部分石油产出，沙特事件已经超出市场的预期，而且事态有扩大的趋势。
                          今年物价情况如何
                          @北京青年报【国家统计局：下一步加大逆周期调节力度】国家统计局新闻发言人付凌晖昨天在国务院新闻办公室举行的新闻发布会上，对外介绍了8月份国民经济运行情况。
                          他表示，前8个月CPI同比上涨2.4%，比7月略微扩大0.1个百分点。从8月份当月情况来看，CPI上涨2.8%，与7月持平，总体来看我国价格形势保持稳定。从当前情况来看，价格上涨结构性特点比较明显。首先，目前价格上涨主要是由食品价格上涨影响的，8月份食品价格同比上涨10%，涨幅比7月扩大0.9个百分点。影响当月同比涨幅1.9个百分点，占2.8%的同比涨幅接近70%，其中猪肉价格上涨46.7%，涨幅比7月扩大19.7个百分点，影响当月价格涨幅1.1个百分点，接近全部价格涨幅的40%。所以，CPI上涨主要受食品价格的上涨影响。
                          而前期涨幅比较高的食品比如鲜菜、鲜果等价格涨幅等都出现了不同程度的回落。鲜菜8月同比下降了0.8%。前期涨幅较大的鲜果，8月同比涨幅也回落到10个百分点以内。同时，国内非食品价格稳定。
                          楼市降温
                          @新京报【楼市降温，商品房销售面积同比再降】9月16日，国家统计局公布了今年1-8月份全国房地产开发投资和销售情况，综合近几个月数据发现，房地产开发投资、商品房销售面积及房地产开发企业到位资金等多项指标均呈现出连续下降或增速回落情况，楼市降温显著。其中，房地产开发投资数据已在5-8月份连续四个月出现增幅回落情况。
                          此外，商品房销售面积数据也有所降温。数据显示，今年1-8月份，商品房销售面积为101849万平方米，同比下降0.6%。新京报记者注意到，这已经是今年以来商品房销售面积连续七个月同比负增长。
                          中原地产首席分析师张大伟认为，从整体看，市场在5-6月反弹后再次进入平稳周期，单月数据环比及同比均出现继续退烧现象。“不论是投资数据还是销售数据，在收紧调控的影响下，市场再次出现放缓迹象。”
                          郭台铭放弃竞选
                          @人民日报【郭台铭：决定不参与明年的台湾地区领导人选举】台湾鸿海集团创办人郭台铭宣布，决定不参与明年的台湾地区领导人选举。
                          郭台铭表示，参选的初衷，是希望能够带领台湾社会齐心拼经济，但投身选战以来，看到的却是一些政治人物为了私利，挑起阶级、仇恨、对立等民粹，经过再三思考之后，希望让社会在关注领导人的选择时，能够回归理性思考与政策层面的讨论，决定不参与明年的选举。
                          郭台铭对支持者表示感谢并表示，不参与选举，不表示放弃参与政治事务，将来会持续积极推动他本人所提出的政策，期盼能够有更多有理念的朋友，愿意一起为台湾继续努力，让台湾有着和平、安定、经济与未来。
                          此前，郭台铭宣布退出中国国民党。有分析认为，退出中国国民党跟郭台铭有意继续角逐 “大选”有关。
                          周二早上好，有没有听周杰伦的最新单曲？
                          周杰伦回归歌坛
                          @新京报【周杰伦回归歌坛，《说好不哭》销量突破两百万】9月16日晚上11:00，周杰伦最新单曲《说好不哭》上线。在新歌上线25分钟时，这首单曲在QQ音乐、酷我音乐、酷狗音乐三个音乐平台上总销售量约229万，销售额突破680万元。
                          如今，距离周杰伦上次推出专辑《周杰伦的床边故事》已经过去了三年多的时间，离上次推出新歌《不爱我就拉倒》也已过去了一年有余。此次新歌依然由周杰伦搭档词人方文山合作完成，主题围绕“成全”和“约定”，在歌曲的后半段中，还出现了五月天主唱阿信的合唱声音。
                          美油创11年以来最大单日涨幅
                          @每日经济新闻【美油创逾11年最大单日涨幅】纽约油价16日上涨，10月交货的纽约轻质原油期货价格收涨8.05美元，涨幅14.68%，报62.90美元/桶，创2008年12月份以来最大单日涨幅。布伦特11月原油期货收涨8.80美元，涨幅14.61%，至少创1988年以来最大单日涨幅，报69.02美元/桶。
                          有市场消息称，沙特阿美Abqaiq工厂未来数周都将无法恢复大部分石油产出，沙特事件已经超出市场的预期，而且事态有扩大的趋势。
                          今年物价情况如何
                          @北京青年报【国家统计局：下一步加大逆周期调节力度】国家统计局新闻发言人付凌晖昨天在国务院新闻办公室举行的新闻发布会上，对外介绍了8月份国民经济运行情况。
                          他表示，前8个月CPI同比上涨2.4%，比7月略微扩大0.1个百分点。从8月份当月情况来看，CPI上涨2.8%，与7月持平，总体来看我国价格形势保持稳定。从当前情况来看，价格上涨结构性特点比较明显。首先，目前价格上涨主要是由食品价格上涨影响的，8月份食品价格同比上涨10%，涨幅比7月扩大0.9个百分点。影响当月同比涨幅1.9个百分点，占2.8%的同比涨幅接近70%，其中猪肉价格上涨46.7%，涨幅比7月扩大19.7个百分点，影响当月价格涨幅1.1个百分点，接近全部价格涨幅的40%。所以，CPI上涨主要受食品价格的上涨影响。
                          而前期涨幅比较高的食品比如鲜菜、鲜果等价格涨幅等都出现了不同程度的回落。鲜菜8月同比下降了0.8%。前期涨幅较大的鲜果，8月同比涨幅也回落到10个百分点以内。同时，国内非食品价格稳定。
                          楼市降温
                          @新京报【楼市降温，商品房销售面积同比再降】9月16日，国家统计局公布了今年1-8月份全国房地产开发投资和销售情况，综合近几个月数据发现，房地产开发投资、商品房销售面积及房地产开发企业到位资金等多项指标均呈现出连续下降或增速回落情况，楼市降温显著。其中，房地产开发投资数据已在5-8月份连续四个月出现增幅回落情况。
                          此外，商品房销售面积数据也有所降温。数据显示，今年1-8月份，商品房销售面积为101849万平方米，同比下降0.6%。新京报记者注意到，这已经是今年以来商品房销售面积连续七个月同比负增长。
                          中原地产首席分析师张大伟认为，从整体看，市场在5-6月反弹后再次进入平稳周期，单月数据环比及同比均出现继续退烧现象。“不论是投资数据还是销售数据，在收紧调控的影响下，市场再次出现放缓迹象。”
                          郭台铭放弃竞选
                          @人民日报【郭台铭：决定不参与明年的台湾地区领导人选举】台湾鸿海集团创办人郭台铭宣布，决定不参与明年的台湾地区领导人选举。
                          郭台铭表示，参选的初衷，是希望能够带领台湾社会齐心拼经济，但投身选战以来，看到的却是一些政治人物为了私利，挑起阶级、仇恨、对立等民粹，经过再三思考之后，希望让社会在关注领导人的选择时，能够回归理性思考与政策层面的讨论，决定不参与明年的选举。
                          郭台铭对支持者表示感谢并表示，不参与选举，不表示放弃参与政治事务，将来会持续积极推动他本人所提出的政策，期盼能够有更多有理念的朋友，愿意一起为台湾继续努力，让台湾有着和平、安定、经济与未来。
                          此前，郭台铭宣布退出中国国民党。有分析认为， 周二早上好，有没有听周杰伦的最新单曲？
                          周杰伦回归歌坛
                          @新京报【周杰伦回归歌坛，《说好不哭》销量突破两百万】9月16日晚上11:00，周杰伦最新单曲《说好不哭》上线。在新歌上线25分钟时，这首单曲在QQ音乐、酷我音乐、酷狗音乐三个音乐平台上总销售量约229万，销售额突破680万元。
                          如今，距离周杰伦上次推出专辑《周杰伦的床边故事》已经过去了三年多的时间，离上次推出新歌《不爱我就拉倒》也已过去了一年有余。此次新歌依然由周杰伦搭档词人方文山合作完成，主题围绕“成全”和“约定”，在歌曲的后半段中，还出现了五月天主唱阿信的合唱声音。
                          美油创11年以来最大单日涨幅
                          @每日经济新闻【美油创逾11年最大单日涨幅】纽约油价16日上涨，10月交货的纽约轻质原油期货价格收涨8.05美元，涨幅14.68%，报62.90美元/桶，创2008年12月份以来最大单日涨幅。布伦特11月原油期货收涨8.80美元，涨幅14.61%，至少创1988年以来最大单日涨幅，报69.02美元/桶。
                          有市场消息称，沙特阿美Abqaiq工厂未来数周都将无法恢复大部分石油产出，沙特事件已经超出市场的预期，而且事态有扩大的趋势。
                          今年物价情况如何
                          @北京青年报【国家统计局：下一步加大逆周期调节力度】国家统计局新闻发言人付凌晖昨天在国务院新闻办公室举行的新闻发布会上，对外介绍了8月份国民经济运行情况。
                          他表示，前8个月CPI同比上涨2.4%，比7月略微扩大0.1个百分点。从8月份当月情况来看，CPI上涨2.8%，与7月持平，总体来看我国价格形势保持稳定。从当前情况来看，价格上涨结构性特点比较明显。首先，目前价格上涨主要是由食品价格上涨影响的，8月份食品价格同比上涨10%，涨幅比7月扩大0.9个百分点。影响当月同比涨幅1.9个百分点，占2.8%的同比涨幅接近70%，其中猪肉价格上涨46.7%，涨幅比7月扩大19.7个百分点，影响当月价格涨幅1.1个百分点，接近全部价格涨幅的40%。所以，CPI上涨主要受食品价格的上涨影响。
                          而前期涨幅比较高的食品比如鲜菜、鲜果等价格涨幅等都出现了不同程度的回落。鲜菜8月同比下降了0.8%。前期涨幅较大的鲜果，8月同比涨幅也回落到10个百分点以内。同时，国内非食品价格稳定。
                          楼市降温
                          @新京报【楼市降温，商品房销售面积同比再降】9月16日，国家统计局公布了今年1-8月份全国房地产开发投资和销售情况，综合近几个月数据发现，房地产开发投资、商品房销售面积及房地产开发企业到位资金等多项指标均呈现出连续下降或增速回落情况，楼市降温显著。其中，房地产开发投资数据已在5-8月份连续四个月出现增幅回落情况。
                          此外，商品房销售面积数据也有所降温。数据显示，今年1-8月份，商品房销售面积为101849万平方米，同比下降0.6%。新京报记者注意到，这已经是今年以来商品房销售面积连续七个月同比负增长。
                          中原地产首席分析师张大伟认为，从整体看，市场在5-6月反弹后再次进入平稳周期，单月数据环比及同比均出现继续退烧现象。“不论是投资数据还是销售数据，在收紧调控的影响下，市场再次出现放缓迹象。”
                          郭台铭放弃竞选
                          @人民日报【郭台铭：决定不参与明年的台湾地区领导人选举】台湾鸿海集团创办人郭台铭宣布，决定不参与明年的台湾地区领导人选举。
                          郭台铭表示，参选的初衷，是希望能够带领台湾社会齐心拼经济，但投身选战以来，看到的却是一些政治人物为了私利，挑起阶级、仇恨、对立等民粹，经过再三思考之后，希望让社会在关注领导人的选择时，能够回归理性思考与政策层面的讨论，决定不参与明年的选举。
                          郭台铭对支持者表示感谢并表示，不参与选举，不表示放弃参与政治事务，将来会持续积极推动他本人所提出的政策，期盼能够有更多有理念的朋友，愿意一起为台湾继续努力，让台湾有着和平、安定、经济与未来。
                          此前，郭台铭宣布退出中国国民党。有分析认为，
                          sdsfsdfdsfd
                          @北京青年报【国家统计局：下一步加大逆周期调节力度】国家统计局新闻发言人付凌晖昨天在国务院新闻办公室举行的新闻发布会上，对外介绍了8月份国民经济运行情况。
                          他表示，前8个月CPI同比上涨2.4%，比7月略微扩大0.1个百分点。从8月份当月情况来看，CPI上涨2.8%，与7月持平，总体来看我国价格形势保持稳定。从当前情况来看，价格上涨结构性特点比较明显。首先，目前价格上涨主要是由食品价格上涨影响的，8月份食品价格同比上涨10%，涨幅比7月扩大0.9个百分点。影响当月同比涨幅1.9个百分点，占2.8%的同比涨幅接近70%，其中猪肉价格上涨46.7%，涨幅比7月扩大19.7个百分点，影响当月价格涨幅1.1个百分点，接近全部价格涨幅的40%。所以，CPI上涨主要受食品价格的上涨影响。
                          而前期涨幅比较高的食品比如鲜菜、鲜果等价格涨幅等都出现了不同程度的回落。鲜菜8月同比下降了0.8%。前期涨幅较大的鲜果，8月同比涨幅也回落到10个百分点以内。同时，国内非食品价格稳定。
                          楼市降温
                          @新京报【楼市降温，商品房销售面积同比再降】9月16日，国家统计局公布了今年1-8月份全国房地产开发投资和销售情况，综合近几个月数据发现，房地产开发投资、商品房销售面积及房地产开发企业到位资金等多项指标均呈现出连续下降或增速回落情况，楼市降温显著。其中，房地产开发投资数据已在5-8月份连续四个月出现增幅回落情况。
                          此外，商品房销售面积数据也有所降温。数据显示，今年1-8月份，商品房销售面积为101849万平方米，同比下降0.6%。新京报记者注意到，这已经是今年以来商品房销售面积连续七个月同比负增长。
                          中原地产首席分析师张大伟认为，从整体看，市场在5-6月反弹后再次进入平稳周期，单月数据环比及同比均出现继续退烧现象。“不论是投资数据还是销售数据，在收紧调控的影响下，市场再次出现放缓迹象。”
                          郭台铭放弃竞选
                          @人民日报【郭台铭：决定不参与明年的台湾地区领导人选举】台湾鸿海集团创办人郭台铭宣布，决定不参与明年的台湾地区领导人选举。
                          郭台铭表示，参选的初衷，是希望能够带领台湾社会齐心拼经济，但投身选战以来，看到的却是一些政治人物为了私利，挑起阶级、仇恨、对立等民粹，经过再三思考之后，希望让社会在关注领导人的选择时，能够回归理性思考与政策层面的讨论，决定不参与明年的选举。
                          郭台铭对支持者表示感谢并表示，不参与选举，不表示放弃参与政治事务，将来会持续积极推动他本人所提出的政策，期盼能够有更多有理念的朋友，愿意一起为台湾继续努力，让台湾有着和平、安定、经济与未来。
                          此前，郭台铭宣布退出中国国民党。有分析认为，
                          woshi谁呀呀呀呀呀呀呀呀呀呀呀
                        </Scroll>
                      </TabPane>
                      <TabPane label="TextView"></TabPane>
                    </Tabs>
                    <!-- <div class="spider-text">控制台</div> -->
                  </div>
                </Split>
              </div>
            </div>
          </Content>
        </Layout>
      </Layout>
      <div class="spider-footer">
        <div class="spider-footer-btn">
          <Button type="info" size="small">保存</Button>
          <Button type="primary" size="small">运行</Button>
        </div>
      </div>
    </Layout>
    <Login :loginModal="loginModal"></Login>
  </div>
</template>
<script>
// import MyEditor from "./components/MyEditor";
import "./static/css/index.css";
import MonacoEditor from "monaco-editor-vue";
import FTab from "./components/F-Tab";
import Login from "./components/login-reg/login";
export default {
  name: "App",
  components: {
    MonacoEditor,
    FTab,
    Login
  },
  data() {
    return {
      loginModal: false,
      spiderTabShow: true,
      scrollHeight: 80, //控制台滚动区域高度
      domHeight: { height: window.innerHeight - 207 + "px" },
      split2: 0.8,
      currentLanguage: "javascript",
      languageList: [
        {
          value: "javascript",
          label: "JavaScript"
        },
        {
          value: "html",
          label: "Html"
        },
        {
          value: "typescript",
          label: "TypeScript"
        },
        {
          value: "java",
          label: "Java"
        },
        {
          value: "css",
          label: "CSS"
        },
        {
          value: "json",
          label: "JSON"
        },
        {
          value: "xml",
          label: "XML"
        },
        {
          value: "markdown",
          label: "Markdown"
        },
        {
          value: "python",
          label: "Python"
        },
        {
          value: "golang",
          label: "Golang"
        }
      ],
      urlList: [
        {
          value: "http://baidu.com",
          label: "http://baidu.com"
        }
      ],
      modelLanguage: "javascript",
      modelUrl: "",
      editorHeight: window.innerHeight - 247,
      editorWidth: window.innerWidth - 274,
      options: {
        //  selectOnLineNumbers: true,
        //   roundedSelection: false,
        //   readOnly: false, // 只读
        //   cursorStyle: "line", //光标样式
        //   automaticLayout: false, //自动布局
        //   glyphMargin: true, //字形边缘
        //   useTabStops: false,
        //   fontSize: 28, //字体大小
        //   autoIndent: true //自动布局
        //quickSuggestionsDelay: 500,   //代码提示延时
        //Monaco Editor Options
      }
    };
  },
  methods: {
    onChange(value) {
      window.console.log(this.editorHeight + "---" + value);
    },
    changeLanguage(value) {
      this.currentLanguage = value;
    },
    changeConsoleSize() {
      var he = document.getElementsByClassName("bottom-pane")[0].offsetHeight; //控制台的高度
      this.scrollHeight = he - 50; //控制台滚动区域高度
    },
    showLogin() {
      this.loginModal = true;
    }
  },
  mounted() {}
};
</script>